# PANDAS

In [1]:
# pandas series object
import pandas as pd

In [2]:
name=['yogi','tisu','oppl','lasd']
pd.Series(name)
# index     name
# dtype object i.e string

0    yogi
1    tisu
2    oppl
3    lasd
dtype: object

In [3]:
val=[1,5,5,56,2,3]
pd.Series(val)
# here dtype is int64
# similarly for boolean(true false) dtype is bool

0     1
1     5
2     5
3    56
4     2
5     3
dtype: int64

In [4]:
n=pd.Series(name)

In [5]:
# attriburtes
n.values
n.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# method
rate=[52.2,63.1,56.4,96.5,23.9]
r=pd.Series(rate)
r

0    52.2
1    63.1
2    56.4
3    96.5
4    23.9
dtype: float64

In [7]:
r.sum()

292.1

In [8]:
r.product()

428453979.0948

In [9]:
r.mean()

58.42

In [10]:
days=['mon','tue','wed','thur']
pd.Series(name,days)
# shift+tab for informaton about method

mon     yogi
tue     tisu
wed     oppl
thur    lasd
dtype: object

# insert csv file

In [47]:
# csv file
p=pd.read_csv("DataSets-master/births.csv",squeeze=True,usecols=['gender'])
# squeeze converts into series data
# usecols show series data wrt particular coloumn withhin list

In [48]:
p.head() # starting 5 value

0    F
1    M
2    F
3    M
4    F
Name: gender, dtype: object

In [49]:
p.head(10)

0    F
1    M
2    F
3    M
4    F
5    M
6    F
7    M
8    F
9    M
Name: gender, dtype: object

In [50]:
p.tail() # last 5 val

15542    M
15543    F
15544    M
15545    F
15546    M
Name: gender, dtype: object

In [51]:
p.values

array(['F', 'M', 'F', ..., 'M', 'F', 'M'], dtype=object)

In [52]:
p.index

RangeIndex(start=0, stop=15547, step=1)

In [53]:
p.is_unique
# tells unique value ie repeted value false means repeted value exist

False

In [54]:
p.ndim

1

In [55]:
p.shape

(15547,)

In [56]:
p.size

15547

In [62]:
# index_sorting
p.sort_values(ascending=False,inplace=True)
p.head(4)

15546    M
13006    M
1345     M
12854    M
Name: gender, dtype: object

In [66]:
p.sort_index(ascending=False,inplace=True)
p.head(4)

15546    M
15545    F
15544    M
15543    F
Name: gender, dtype: object

In [75]:
# extract value from data
#1. through index
#2. through position
data=pd.read_csv("DataSets-master/Titanic_Data.csv",usecols=['Name'],squeeze=True)
data.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [76]:
data[100]

'Petranec, Miss. Matilda'

In [77]:
data[[100,200,500]]# multiple value nested list

100           Petranec, Miss. Matilda
200    Vande Walle, Mr. Nestor Cyriel
500                  Calic, Mr. Petar
Name: Name, dtype: object

In [78]:
data[50:101]

50                            Panula, Master. Juha Niilo
51                          Nosworthy, Mr. Richard Cater
52              Harper, Mrs. Henry Sleeper (Myna Haxtun)
53     Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...
54                        Ostby, Mr. Engelhart Cornelius
55                                     Woolner, Mr. Hugh
56                                     Rugg, Miss. Emily
57                                   Novel, Mr. Mansouer
58                          West, Miss. Constance Mirium
59                    Goodwin, Master. William Frederick
60                                 Sirayanian, Mr. Orsen
61                                   Icard, Miss. Amelie
62                           Harris, Mr. Henry Birkhardt
63                                 Skoog, Master. Harald
64                                 Stewart, Mr. Albert A
65                              Moubarek, Master. Gerios
66                          Nye, Mrs. (Elizabeth Ramell)
67                              Crease, Mr. Ernest James
68                       Andersson, Miss. Erna Alexandra
69                                     Kink, Mr. Vincenz
70                            Jenkin, Mr. Stephen Curnow
71                            Goodwin, Miss. Lillian Amy
72                                  Hood, Mr. Ambrose Jr
73                           Chronopoulos, Mr. Apostolos
74                                         Bing, Mr. Lee
75                               Moen, Mr. Sigurd Hansen
76                                     Staneff, Mr. Ivan
77                              Moutal, Mr. Rahamin Haim
78                         Caldwell, Master. Alden Gates
79                              Dowdell, Miss. Elizabeth
80                                  Waelens, Mr. Achille
81                           Sheerlinck, Mr. Jan Baptist
82                        McDermott, Miss. Brigdet Delia
83                               Carrau, Mr. Francisco M
84                                   Ilett, Miss. Bertha
85     Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...
86                                Ford, Mr. William Neal
87                         Slocovski, Mr. Selman Francis
88                            Fortune, Miss. Mabel Helen
89                                Celotti, Mr. Francesco
90                                  Christmann, Mr. Emil
91                            Andreasson, Mr. Paul Edvin
92                           Chaffee, Mr. Herbert Fuller
93                               Dean, Mr. Bertram Frank
94                                     Coxon, Mr. Daniel
95                           Shorney, Mr. Charles Joseph
96                             Goldschmidt, Mr. George B
97                       Greenfield, Mr. William Bertram
98                  Doling, Mrs. John T (Ada Julia Bone)
99                                     Kantor, Mr. Sinai
100                              Petranec, Miss. Matilda
Name: Name, dtype: object

In [79]:
data[-30:]

861                          Giles, Mr. Frederick Edward
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
864                               Gill, Mr. John William
865                             Bystrom, Mrs. (Karolina)
866                         Duran y More, Miss. Asuncion
867                 Roebling, Mr. Washington Augustus II
868                          van Melkebeke, Mr. Philemon
869                      Johnson, Master. Harold Theodor
870                                    Balkic, Mr. Cerin
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                             Carlsson, Mr. Frans Olof
873                          Vander Cruyssen, Mr. Victor
874                Abelson, Mrs. Samuel (Hannah Wizosky)
875                     Najib, Miss. Adele Kiamie "Jane"
876                        Gustafsson, Mr. Alfred Ossian
877                                 Petroff, Mr. Nedelio
878                                   Laleff, Mr. Kristo
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
881                                   Markun, Mr. Johann
882                         Dahlberg, Miss. Gerda Ulrika
883                        Banfield, Mr. Frederick James
884                               Sutehall, Mr. Henry Jr
885                 Rice, Mrs. William (Margaret Norton)
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, dtype: object

In [80]:
data[-30:-10]

861                          Giles, Mr. Frederick Edward
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863                    Sage, Miss. Dorothy Edith "Dolly"
864                               Gill, Mr. John William
865                             Bystrom, Mrs. (Karolina)
866                         Duran y More, Miss. Asuncion
867                 Roebling, Mr. Washington Augustus II
868                          van Melkebeke, Mr. Philemon
869                      Johnson, Master. Harold Theodor
870                                    Balkic, Mr. Cerin
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872                             Carlsson, Mr. Frans Olof
873                          Vander Cruyssen, Mr. Victor
874                Abelson, Mrs. Samuel (Hannah Wizosky)
875                     Najib, Miss. Adele Kiamie "Jane"
876                        Gustafsson, Mr. Alfred Ossian
877                                 Petroff, Mr. Nedelio
878                                   Laleff, Mr. Kristo
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880         Shelley, Mrs. William (Imanita Parrish Hall)
Name: Name, dtype: object

In [110]:
# extract value by index_labels
data_1=pd.read_csv("DataSets-master/Titanic_Data.csv",squeeze=True)
data_1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [112]:
# .get() method
data_1.get(3,default="not exist")

'not exist'